export const trousersOperationsByCategory = {
    "Обробка зрізу": {
        уточнення_крою: ["уточнити деталі крою"],
        обметування_зрізів: ["обметати зрізи"]
    },
    "ВТО деталей": {
        вто_передніх_половинок: ["виконати ВТО передніх половинок"],
        вто_задніх_половинок: ["запрасувати складки"]
    },
    "Обробка прорізної кишені з клапаном": {
        обробка_кишені_з_клапаном: ["обробка прорізної кишені з клапаном"],
        дублювання_клапана: ["продублювати клапан прокладкою"],
        викроювання_клапана: ["викроїти клапан"],
        намічання_лінії_обшивання: ["наміти лінію обшивання клапана"],
        обшивання_клапана: ["обшити клапан підклапаном"],
        підрізання_кутиків: ["підрізати кутики клапана"],
        вивертання_клапана: ["вивернути і виправити клапан"],
        припрасування_клапана: ["припрасувати клапан"],
        видалення_ниток: ["видалити нитки вифастригування"],
        оздоблювальна_строчка: ["прокласти оздоблювальну строчку"],
        намічання_пришивання: ["наміти лінію пришивання клапана"],
        запрасування_обшивки: ["запрасувати обшивку"],
        обметування_обшивки: ["обметати зріз обшивки"],
        обметування_підзора: ["обметати нижній зріз підзора"],
        настрочування_підзора: ["настрочити підзор на підкладку"],
        намічання_місця_кишені: ["наміти місце розташування кишені"],
        пришивання_обшивки: ["пришити обшивку до штанів"],
        пришивання_клапана: ["пришити клапан до штанів"],
        розрізання_входу: ["розрізати вхід в кишеню"],
        вивертання_обшивки: ["вивернути і виправити обшивку"],
        вифастригування_кишені: ["вифастригувати кишеню"],
        припрасування_кишені: ["припрасувати кишеню"],
        настрочування_обшивки_на_підкладку: ["настрочити нижній зріз обшивки"],
        зшивання_підкладки: ["зшити підкладку кишені"],
        обметування_підкладки: ["обметати підкладку кишені"],
        настрочування_припусків: ["настрочити припуски шва"],
        припрасування_готовий_вигляд: ["припрасувати в готовому вигляді"]
    },
    "Обробка бічної кишені з відрізним бочком": {
        обробка_бічної_кишені: ["обробка бічної кишені з відрізним бочком"],
        обметування_бочків: ["обметати зовнішній зріз відрізних бочків"],
        настрочування_бочків: ["настрочити відрізний бочок"],
        проклеювання_пружка: ["проклеїти пружок"],
        настрочування_обшивки_на_підкладку_кишені: ["настрочити обметаний зріз обшивки"],
        запрасування_ліній_входу: ["запрасувати лінії входу в кишеню"],
        прокладання_строчки_входу: ["прокласти строчку по лінії входу"],
        закріпки_кінець_кишені: ["поставити закріпки на кінцях кишені"],
        зшивання_підкладки_кишені: ["зшити підкладку кишені"],
        обметування_підкладки_кишені: ["обметати підкладку кишені"]
    },
    "Обробка застібки-блискавки": {
        обробка_застібки_блискавки: ["обробка застібки-блискавки"],
        дублювання_обшивки: ["продублювати обшивку банта"],
        проклеювання_пружка_банта: ["проклеїти пружок по лінії перегину банта"],
        дублювання_відкоска: ["продублювати відкосок"],
        запрасування_зрізу_відкоска: ["запрасувати внутрішній зріз підкладки відкоска"],
        обшивання_відкоска: ["обшити відкосок підкладним відкоском"],
        вивертання_відкоска: ["вивернути і виправити відкосок"],
        пришивання_тасьми_блискавки: ["пришити тасьму-блискавку"],
        настрочування_тасьми: ["настрочити тасьму-блискавку"],
        зшивання_середніх_зрізів: ["зшити середні зрізи"],
        зшивання_банта_і_відкоска: ["зшити суцільно викроєний бант і відкосок"],
        намічання_оздоблювальної_строчки: ["наміти місце розташування оздоблювально-закріплювальної строчки"],
        прокладання_оздоблювальної_строчки: ["прокласти оздоблювально-закріплювальну строчку"],
        закріпка_по_низу: ["виконати закріпку по низу застібки"],
        припрасування_застібки: ["припрасувати застібку в готовому вигляді"]
    },
    "Обробка зрізів штанів": {
        запрасування_стрілок: ["запрасувати стрілки"],
        зшивання_бічних_зрізів: ["зшити бічні зрізи"],
        розпрасування_бічних_зрізів: ["розпрасувати бічні зрізи"],
        зшивання_крокових_зрізів: ["зшити крокові зрізи"],
        розпрасування_крокових_зрізів: ["розпрасувати крокові зрізи"],
        зшивання_середнього_шва: ["зшити середній шов"],
        розпрасування_середнього_шва: ["розпрасувати середній шов"]
    },
    "Обробка поясу в штанах": {
        обробка_поясу: ["обробка поясу в штанах"],
        обметування_хомутиків: ["обметати зрізи хомутиків"],
        запрасування_хомутиків: ["запрасувати хомутики"],
        прокладання_оздоблювальних_строчек: ["прокласти оздоблювальні строчки"],
        настрочування_хомутиків: ["настрочити хомутики"],
        дублювання_поясу: ["продублювати пояс"],
        зшивання_частин_поясу: ["зшити частини поясу"],
        розпрасування_шва_поясу: ["розпрасувати середній шов поясу"],
        пришивання_поясу: ["пришити пояс до верхнього зрізу"],
        запрасування_припусків_поясу: ["запрасувати припуски шва пришивання поясу"],
        настрочування_хомутиків_на_пояс: ["настрочити хомутики на верхній зріз поясу"],
        запрасування_кінця_поясу: ["запрасувати вільний кінець лівої половинки поясу"],
        настрочування_припуску_поясу: ["настрочити підігнутий припуск вільного кінця поясу"],
        обшивання_поясу: ["обшити пояс корсажною стрічкою"],
        надсічка_кутиків: ["надсікти кутики припусків шва"],
        вивертання_поясу: ["вивернути і виправити пояс"],
        настрочування_корсажної_стрічки: ["настрочити корсажну стрічку у шов"],
        припрасування_поясу: ["припрасувати пояс у готовому вигляді"]
    },
    "Обробка низу штанів": {
        уточнення_довжини: ["уточнити довжину бічних швів"],
        намічання_лінії_низу: ["наміти лінію підгину і лінію низу"],
        вирівнювання_зрізів: ["вирівняти нижні зрізи"],
        обметування_нижніх_зрізів: ["обметати нижні зрізи штанів"],
        настрочування_тасьми: ["настрочити тасьму на припуски"],
        вивертання_штанів: ["вивернути штани на виворітний бік"],
        закріплення_припусків: ["закріпити припуски"],
        підшивання_низу: ["підшити низ штанів"]
    },
    "Заключна обробка виробу": {
        заключна_обробка: ["заключна обробка виробу"],
        вивертання_на_лицевий_бік: ["вивернути штани на лицевий бік"],
        прибирання_сміття: ["почистити виріб від сміття"],
        припрасування_нижньої_частини: ["припрасувати нижню частину штанів"],
        припрасування_верхньої_частини: ["припрасувати верхню частину штанів"],
        зняття_полisku: ["випрасувати штани, зняти полиск"],
        намічання_ґудзика: ["наміти місце розташування ґудзика"],
        пришивання_ґудзика: ["пришити ґудзик"],
        намічання_петлі: ["наміти місце розташування петлі"],
        виметування_петлі: ["виметати петлю"]
    }
};

export const equipmentByCategory = {
    "Обробка зрізу": ["Ручний стіл, лекало", "51 кл."],
    "ВТО деталей": ["Batistella", "Batistella", "Крейда, лекало", "1022 кл.", "Batistella", "1022 кл.", "Batistella"],
    "Обробка прорізної кишені з клапаном": [
        "Batistella", "Лекало, крейда, ручний стіл", "Лекало, крейда, ручний стіл", "1022 кл.", "Стіл, ножиці", "Стіл, голка",
        "Batistella", "Стіл, ножиці", "1022 кл.", "1022 кл.", "Batistella", "51 кл.", "51 кл.", "1022 кл.", "Крейда, лінійка",
        "1022 кл.", "1022 кл.", "Ножиці", "Ручний стіл", "Голка, нитка", "Batistella", "1022 кл.", "1022 кл.", "51 кл.",
        "1022 кл.", "Batistella"
    ],
    "Обробка бічної кишені з відрізним бочком": [
        "51 кл.", "1022 кл.", "Batistella", "1022 кл.", "Batistella", "1022 кл.", "1022 кл.", "1022 кл.", "51 кл.", "Batistella"
    ],
    "Обробка застібки-блискавки": [
        "Batistella", "Batistella", "Batistella", "Batistella", "1022 кл.", "Ручний стіл", "1022 кл.", "1022 кл.", "1022 кл.",
        "1022 кл.", "1022 кл.", "Крейда, лекало", "1022 кл.", "1022 кл.", "Batistella"
    ],
    "Обробка зрізів штанів": ["1022 кл.", "1022 кл.", "Batistella", "1022 кл.", "Batistella", "1022 кл.", "Batistella"],
    "Обробка поясу в штанах": [
        "51 кл.", "Batistella", "1022 кл.", "1022 кл.", "Batistella", "1022 кл.", "1022 кл.", "1022 кл.", "1022 кл.", "Batistella",
        "1022 кл.", "Batistella", "1022 кл.", "1022 кл.", "Batistella", "Ручний стіл, ножиці", "Ручний стіл", "1022 кл.",
        "Batistella"
    ],
    "Обробка низу штанів": [
        "Ручний стіл", "Ручний стіл", "Ручний стіл", "51 кл.", "1022 кл.", "Ручний стіл", "1022 кл.", "Голка, нитка"
    ],
    "Заключна обробка виробу": ["-", "Щітка", "Batistella", "Batistella", "Batistella", "Ручний стіл, кравецька крейда", "Ручний стіл, голка, нитка", "Ручний стіл, кравецька крейда", "MAQI 783E"]
};

export const professionByCategory = {
    "Обробка зрізу": ["Р", "С"],
    "ВТО деталей": ["Пр", "Пр", "Р", "М", "Пр", "М", "Пр"],
    "Обробка прорізної кишені з клапаном": [
        "Пр", "Р", "Р", "М", "Р", "Р", "Пр", "Р", "М", "Р", "Пр", "С", "С", "М", "Р", "М", "М", "Р", "Р", "P", "Пр", "М", "М",
        "С", "М", "Пр"
    ],
    "Обробка бічної кишені з відрізним бочком": ["С", "М", "Пр", "М", "Пр", "М", "М", "М", "С", "Пр"],
    "Обробка застібки-блискавки": [
        "Пр", "Пр", "Пр", "Пр", "М", "Р", "М", "М", "М", "М", "М", "Р", "М", "М", "Пр"
    ],
    "Обробка зрізів штанів": ["М", "М", "Пр", "М", "Пр", "М", "Пр"],
    "Обробка поясу в штанах": [
        "С", "Пр", "М", "М", "Пр", "М", "М", "М", "М", "Пр", "М", "Пр", "М", "М", "Пр", "Р", "Р", "М", "Пр"
    ],
    "Обробка низу штанів": ["Р", "Р", "Р", "С", "М", "Р", "М", "Р"],
    "Заключна обробка виробу": ["Р", "Р", "Пр", "Пр", "Пр", "Р", "Р", "Р", "С"]
};

export const technicalConditionsByCategory = {
    "Обробка зрізу": ["По лекалу", "З лицевої сторони"],
    "ВТО деталей": [
        "Половинки штанів складають лицем всередину. Відтягують боковий і кроковий зріз, спрасовують посередині. Половинку брюк(кожну окремо) перегинають по довжині, суміщають боковий(кроковий зріз). Від низу до лінії коліна верхній згин направляють до виточки або складки",
        "Відтягують середні зрізи на ділянці найбільшого прогину і кроковий зріз не доходячи до коліна на 5-7 см. Спрасовують на рівні підсідничної складки. Для створення об’єму спрасовують боковий і кроковий зріз від лінії коліна до низу.",
        "З виворітньої сторони", "По намічених лініях", "В сторону середнього зрізу штанів", "На 2 см.", "В сторону бічного зрізу штанів"
    ],
    "Обробка прорізної кишені з клапаном": [
        "Через вологий пропрасувальник", "По лекалу", "По лекалу", "Шириною шва – 0.7 см.", "0.1 – 0.2 см. до строчки, надсікаючи в місцях округлення",
        "Утворюючи перекант 1-2 мм.", "Через вологий пропрасовувач", "-", "0.2 -0.3 см.", "Відстань від зрізу клапана до лінії 1 см.",
        "Через вологий пропрасувальник, на 1/3 довжини", "-", "З лицевої сторони", "По середині строчки обметування",
        "Трьома горизонтальними і двома вертикальними лініями", "На 1 см від згину обшивки, по наміченій лінії", "По наміченій лінії",
        "Не доходячи до строчок на 1 – 2 мм.", "На виворітню сторону", "-", "Через вологий пропрасувальник", "Вздовж обметаного зрізу",
        "Ширина шва 1 см.", "По лицевій стороні", "Ширина шва 1 – 2 мм.", "Через вологий пропрасувальник"
    ],
    "Обробка бічної кишені з відрізним бочком": [
        "З лицевої сторони", "Вздовж лінії обметування", "Ширина пружка 1 см., через вологий пропрасовувач", "Ширина шва 0.5 см.",
        "Через вологий пропрасувальник", "Ширина шва 0.5 – 0.7 см. паралельно лінії входу в кишеню", "-", "Ширина шва 1 см.",
        "З лицевої сторони", "Через вологий пропрасувальник"
    ],
    "Обробка застібки-блискавки": [
        "Через вологий пропрасовувач", "Через вологий пропрасовувач, зі сторони банта", "На 0.5 см.", "Ширина шва 0.5 см.",
        "Ширина шва 0.5 см.", "Утворюючи перекант на 0.1 – 0.2 см.", "-", "На 0.1 – 0.2 см. від підігнутого краю", "У закритому вигляді",
        "Ширина шва 1 см.", "Поставити закріпку на криволінійній ділянці гульфика довжиною 1 см.", "По лекалу",
        "По наміченій лінії, виконуючи закріпку на криволінійній ділянці, довжиною 1 см.",
        "Продовжуючи оздоблювально-закріплюючу строчку доверху на 1 см.", "Через вологий пропрасувальник"
    ],
    "Обробка зрізів штанів": [
        "По намічених лініях", "Ширина шва 1 см.", "Через вологий пропрасовувач", "Ширина шва 1 см.", "Через вологий пропрасовувач",
        "Подвійною строчкою на 0.1 мм. від першої", "На задній половинці штанів на 1/3"
    ],
    "Обробка поясу в штанах": [
        "З лицевої сторони", "Вздовж, обметаними зрізами до середини деталі", "На відстані 0.1 – 0.2 см. від запрасованих згинів",
        "Лицем вниз, на відстані 0.5 – 0.7 см. від зрізу по моделі", "Не дублюючи припуски на шов", "На відстані 1 см. від зрізу",
        "-", "Ширина шва 1 см.", "-", "Утворюючи напуск по моделі", "На відстані 0.2 – 0.3 см. від зрізу", "По надсічках",
        "Ширина шва 0.1 – 0.2 см.", "Ширина шва 0.5 см.", "На 0.1 – 0.2 см. від шва обшивання", "-", "В шов пришивання поясу",
        "Через вологий пропрасувальник"
    ],
    "Обробка низу штанів": [
        "Відповідно до лекала", "Відповідно до попередньо відміряної довжини", "По наміченій лінії", "З лицевої сторони",
        "З обох сторін тасьми, ширина шва 0.1 – 0.2 см.", "-", "-", "Вручну, потайним швом"
    ],
    "Заключна обробка виробу": [
        "-", "-", "Через вологий пропрасувальник", "Через вологий пропрасувальник", "Через вологий пропрасувальник",
        "Застібнувши застібку- блискавку і зрівнявши лінію середини на обох половинках штанів", "Відповідно позначці", "-", "-"
    ]
};